In [1]:
import pandas as pd
import numpy as np

In [3]:
data= np.random.randn(4,3)

In [4]:
data

array([[ 0.22146207,  0.92528168,  0.05442742],
       [ 0.18998145,  2.3135132 , -1.24796573],
       [-1.07584009, -0.78257855, -0.87788638],
       [ 0.98140189,  0.54810672, -0.29908714]])

In [5]:
dataFrame=pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0  0.221462  0.925282  0.054427
1  0.189981  2.313513 -1.247966
2 -1.075840 -0.782579 -0.877886
3  0.981402  0.548107 -0.299087

In [8]:
type(dataFrame[0])

pandas.core.series.Series

In [10]:
yeniDataFrame=pd.DataFrame(data,index=["atıl","zeynep","atlas","mehmet"],columns=["maas","yas","calisma saati"])

In [11]:
yeniDataFrame

            maas       yas  calisma saati
atıl    0.221462  0.925282       0.054427
zeynep  0.189981  2.313513      -1.247966
atlas  -1.075840 -0.782579      -0.877886
mehmet  0.981402  0.548107      -0.299087

In [12]:
yeniDataFrame["yas"]

atıl      0.925282
zeynep    2.313513
atlas    -0.782579
mehmet    0.548107
Name: yas, dtype: float64

In [13]:
yeniDataFrame["maas"]

atıl      0.221462
zeynep    0.189981
atlas    -1.075840
mehmet    0.981402
Name: maas, dtype: float64

In [14]:
yeniDataFrame[["maas","yas"]]

            maas       yas
atıl    0.221462  0.925282
zeynep  0.189981  2.313513
atlas  -1.075840 -0.782579
mehmet  0.981402  0.548107

In [15]:
yeniDataFrame.loc["atıl"]

maas             0.221462
yas              0.925282
calisma saati    0.054427
Name: atıl, dtype: float64

In [16]:
yeniDataFrame.iloc[0]

maas             0.221462
yas              0.925282
calisma saati    0.054427
Name: atıl, dtype: float64

In [17]:
yeniDataFrame

            maas       yas  calisma saati
atıl    0.221462  0.925282       0.054427
zeynep  0.189981  2.313513      -1.247966
atlas  -1.075840 -0.782579      -0.877886
mehmet  0.981402  0.548107      -0.299087

In [19]:
yeniDataFrame["emeklilik yasi"] =yeniDataFrame["yas"]+yeniDataFrame["yas"]

In [20]:
yeniDataFrame

            maas       yas  calisma saati  emeklilik yasi
atıl    0.221462  0.925282       0.054427        1.850563
zeynep  0.189981  2.313513      -1.247966        4.627026
atlas  -1.075840 -0.782579      -0.877886       -1.565157
mehmet  0.981402  0.548107      -0.299087        1.096213

In [21]:
yeniDataFrame.drop("emeklilik yasi", axis =1)

            maas       yas  calisma saati
atıl    0.221462  0.925282       0.054427
zeynep  0.189981  2.313513      -1.247966
atlas  -1.075840 -0.782579      -0.877886
mehmet  0.981402  0.548107      -0.299087

In [22]:
yeniDataFrame.drop("mehmet", axis =0)

            maas       yas  calisma saati  emeklilik yasi
atıl    0.221462  0.925282       0.054427        1.850563
zeynep  0.189981  2.313513      -1.247966        4.627026
atlas  -1.075840 -0.782579      -0.877886       -1.565157

In [23]:
yeniDataFrame

            maas       yas  calisma saati  emeklilik yasi
atıl    0.221462  0.925282       0.054427        1.850563
zeynep  0.189981  2.313513      -1.247966        4.627026
atlas  -1.075840 -0.782579      -0.877886       -1.565157
mehmet  0.981402  0.548107      -0.299087        1.096213

In [24]:
yeniDataFrame.drop("emeklilik yasi", axis =1, inplace=True)

In [25]:
yeniDataFrame

            maas       yas  calisma saati
atıl    0.221462  0.925282       0.054427
zeynep  0.189981  2.313513      -1.247966
atlas  -1.075840 -0.782579      -0.877886
mehmet  0.981402  0.548107      -0.299087

In [26]:
yeniDataFrame.loc["atıl","yas"]

0.9252816781412688

In [27]:
yeniDataFrame <0

         maas    yas  calisma saati
atıl    False  False          False
zeynep  False  False           True
atlas    True   True           True
mehmet  False  False           True

In [29]:
yeniDataFrame[yeniDataFrame["maas"] >0]

            maas       yas  calisma saati
atıl    0.221462  0.925282       0.054427
zeynep  0.189981  2.313513      -1.247966
mehmet  0.981402  0.548107      -0.299087

In [30]:
yeniDataFrame.reset_index()

    index      maas       yas  calisma saati
0    atıl  0.221462  0.925282       0.054427
1  zeynep  0.189981  2.313513      -1.247966
2   atlas -1.075840 -0.782579      -0.877886
3  mehmet  0.981402  0.548107      -0.299087

In [31]:
yeniDataFrame

            maas       yas  calisma saati
atıl    0.221462  0.925282       0.054427
zeynep  0.189981  2.313513      -1.247966
atlas  -1.075840 -0.782579      -0.877886
mehmet  0.981402  0.548107      -0.299087

In [32]:
yeniIndexListe=["ati","zey","atl","meh"]

In [33]:
yeniDataFrame["yeni index"]=yeniIndexListe

In [34]:
yeniDataFrame.set_index("yeni index",inplace=True)

In [35]:
yeniDataFrame

                maas       yas  calisma saati
yeni index
ati         0.221462  0.925282       0.054427
zey         0.189981  2.313513      -1.247966
atl        -1.075840 -0.782579      -0.877886
meh         0.981402  0.548107      -0.299087

In [37]:
ilkIndexler=["Simpson","Simpson","Simpson","South park","South park"]

In [38]:
icIndexler=["homer","bart","marge","kenny","kyle"]

In [40]:
birlesmisIndex=list(zip(ilkIndexler,icIndexler))

In [41]:
birlesmisIndex

[('Simpson', 'homer'),
 ('Simpson', 'bart'),
 ('Simpson', 'marge'),
 ('South park', 'kenny'),
 ('South park', 'kyle')]

In [42]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [43]:
birlesmisIndex

MultiIndex([(   'Simpson', 'homer'),
            (   'Simpson',  'bart'),
            (   'Simpson', 'marge'),
            ('South park', 'kenny'),
            ('South park',  'kyle')],
           )

In [44]:
cizgiFilmListe=[[40,"a"],[10,"b"],[30,"c"],[42,"d"],[85,"e"],[96,"f"]]

In [45]:
 cizgiFilmNumpyDizi=np.array(cizgiFilmListe)

In [53]:
cizgiFilmDataFrame=pd.DataFrame(
    cizgiFilmNumpyDizi,
    index=birlesmisIndex,
    columns=["yas","meslek"])

NameError: name 'cizgiFilmNumpyDizi' is not defined